#include<iostream>
using namespace std;
void main()
{
	//常量指针*******************************************************
	//指向常量的指针，即使指向的是变量不是常量，通过常量指针也不能修改这个值，但是常量指针可以在转而指向另一个值
	int n = 1, m = 2;
	const int *pn1 = &n;//常量指针
	int const *pn2 = &n;//常量指针

	//*pn1 = 5;//报错 必须是可修改的左值
	cout << *pn1 << endl;
	pn1 = &m;//不报错 pn1可以指向新的值
	cout << *pn1 << endl;

	cout << *pn2 << endl;
	n--;//n的值不能通过常量指针修改，但是可以通过n修改
	cout << *pn2 << endl;
	cout << "*********************************************************************" << endl;


	//指针常量
	//一个常量，常量的值是一个指针
	//指向的值可修改，但是不能指向别的值
	int a=10,b=100;
	int *const pa = &a; //const放在指针声明操作符的右侧，常量必须赋初值
	cout << *pa << endl;
	a++;
	cout << *pa << endl;
	(*pa)++;//指向的值可以修改
	cout << *pa << endl;

	//pa = &b;//报错 必须是可修改的左值

	while (1);
}